app/controllers/chats_controller.rb

  def show
    @friend = User.find(params[:friend_id])
    @messages = Message
                .where(user: current_user, recipient: @friend)
                .or(Message.where(user: @friend, recipient: current_user))
                .order(created_at: :asc)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE ("messages"."user_id" = ? AND "messages"."recipient_id" = ? OR "messages"."user_id" = ? AND "messages"."recipient_id" = ?) ORDER BY "messages"."created_at" ASC  [["user_id", 3], ["recipient_id", 2], ["user_id", 2], ["recipient_id", 3]]

  def create
    @message = current_user.sent_messages.build(message_params)
    @message.recipient_id = params[:friend_id]

    if @message.save
---
INSERT INTO "messages" ("content", "user_id", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "Hey"], ["user_id", 3], ["recipient_id", 2], ["created_at", "2024-12-03 19:58:10.871113"], ["updated_at", "2024-12-03 19:58:10.871113"]]