app/controllers/credit_cards_controller.rb

    def create
      @credit_card = current_user.build_credit_card(credit_card_params)
      if @credit_card.save
---
INSERT INTO "credit_cards" ("user_id", "last4", "expiration_month", "expiration_year", "card_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def update
      if current_user.credit_card
        current_user.credit_card.destroy # Replace the existing card if one exists
      end

      @credit_card = current_user.build_credit_card(credit_card_params)
      if @credit_card.save
---
DELETE FROM "credit_cards" WHERE "credit_cards"."id" = ?  [["id", 1]]
INSERT INTO "credit_cards" ("user_id", "last4", "expiration_month", "expiration_year", "card_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"