app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params) # create new game(name, code)
    GameUser.create(game: @game, user: current_user)
---
INSERT INTO "game_users" ("user_id", "game_id", "health", "mana") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["game_id", 2], ["health", 240], ["mana", 240]]
INSERT INTO "games" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Rails"], ["code", "EG6A"], ["created_at", "2024-12-03 19:53:53.933537"], ["updated_at", "2024-12-03 19:53:53.933537"]]

  def join
    # Find the game by the provided code (converted to uppercase for consistency)
    @game = Game.find_by(code: params[:code].upcase)

    if @game.nil?
      # Game does not exist
      flash[:alert] = "The game with code #{params[:code]} does not exist."
      redirect_to games_path
    else
      # Game exists, check if the user has already joined
      @game_user = GameUser.find_by(user: current_user, game: @game)
---
SELECT "games".* FROM "games" WHERE "games"."code" = ? LIMIT ?  [["code", "EG6A"], ["LIMIT", 1]]
SELECT "game_users".* FROM "game_users" WHERE "game_users"."user_id" = ? AND "game_users"."game_id" = ? LIMIT ?  [["user_id", 3], ["game_id", 2], ["LIMIT", 1]]

  def index
    @games = current_user.games

    if params[:search].present?
      @users = User.where("username LIKE ?", "%#{params[:search]}%").where.not(id: current_user.id)
---
SELECT "games".* FROM "games" INNER JOIN "game_users" ON "games"."id" = "game_users"."game_id" WHERE "game_users"."user_id" = ?  [["user_id", 1]]