app/controllers/interactions_controller.rb

  def show
    @game = Game.find_by(code: params[:game_id])
    @game_user = @game.game_users.find_by(user: current_user)
    @enemy = @game.enemies.find_by(x_position: @game_user.x_position, y_position: @game_user.y_position)
---
SELECT "games".* FROM "games" WHERE "games"."code" = ? LIMIT ?  [["code", "EG6A"], ["LIMIT", 1]]
SELECT "game_users".* FROM "game_users" WHERE "game_users"."game_id" = ? AND "game_users"."user_id" = ? LIMIT ?  [["game_id", 2], ["user_id", 3], ["LIMIT", 1]]
SELECT "enemies".* FROM "enemies" WHERE "enemies"."game_id" = ? AND "enemies"."x_position" = ? AND "enemies"."y_position" = ? LIMIT ?  [["game_id", 2], ["x_position", 0], ["y_position", 0], ["LIMIT", 1]]

  def attack
    @game = Game.find_by(code: params[:game_id])
    @game_user = @game.game_users.find_by(user: current_user)
    @enemy = @game.enemies.find_by(x_position: @game_user.x_position, y_position: @game_user.y_position)
    @player = current_user.current_skin # Use current_skin for player stats
    @game_id = params[:game_id]

    player_damage, player_critical = calculate_attack_damage(@player, @enemy)
    @enemy.update(health: @enemy.health - player_damage)
---
SELECT "games".* FROM "games" WHERE "games"."code" = ? LIMIT ?  [["code", "EG6A"], ["LIMIT", 1]]
SELECT "game_users".* FROM "game_users" WHERE "game_users"."game_id" = ? AND "game_users"."user_id" = ? LIMIT ?  [["game_id", 2], ["user_id", 3], ["LIMIT", 1]]
SELECT "enemies".* FROM "enemies" WHERE "enemies"."game_id" = ? AND "enemies"."x_position" = ? AND "enemies"."y_position" = ? LIMIT ?  [["game_id", 2], ["x_position", 0], ["y_position", 0], ["LIMIT", 1]]
UPDATE "enemies" SET "health" = ?, "updated_at" = ? WHERE "enemies"."id" = ?  [["health", 262], ["updated_at", "2024-12-03 19:55:05.819559"], ["id", 101]]
UPDATE "game_users" SET "health" = ?, "level" = ?, "mana" = ? WHERE "game_users"."id" = ?  [["health", 120], ["level", 2], ["mana", 120], ["id", 1]]
UPDATE "users" SET "experience" = ?, "health" = ?, "attack" = ?, "defense" = ?, "iq" = ?, "level" = ?, "mana" = ?, "special_attack" = ?, "special_defense" = ? WHERE "users"."id" = ?  [["experience", 200], ["health", 120], ["attack", 40], ["defense", 10], ["iq", 13], ["level", 2], ["mana", 120], ["special_attack", 50], ["special_defense", 25], ["id", 1]]

  def magic_attack
    @game = Game.find_by(code: params[:game_id])
    @game_user = @game.game_users.find_by(user: current_user)
    @enemy = @game.enemies.find_by(x_position: @game_user.x_position, y_position: @game_user.y_position)
    @player = current_user.current_skin # Use current_skin for player stats
    @game_id = params[:game_id]

    case current_user.archetype
    when 'Attacker'
      if @game_user.use_mana(20)
        if rand(1..100) <= 10
          @enemy.health = 0
          message = 'Coin Flip hit!'
        else
          message = 'Coin Flip missed!'
        end
      else
        render json: { success: false, message: 'Not enough mana!' } and return
      end
    when 'Defender'
      if @game_user.use_mana(20)
        player_damage, player_critical = calculate_magic_damage(@player, @enemy)
        @enemy.update(health: @enemy.health - player_damage)
---
SELECT "games".* FROM "games" WHERE "games"."code" = ? LIMIT ?  [["code", "EG6A"], ["LIMIT", 1]]
SELECT "game_users".* FROM "game_users" WHERE "game_users"."game_id" = ? AND "game_users"."user_id" = ? LIMIT ?  [["game_id", 2], ["user_id", 3], ["LIMIT", 1]]
SELECT "enemies".* FROM "enemies" WHERE "enemies"."game_id" = ? AND "enemies"."x_position" = ? AND "enemies"."y_position" = ? LIMIT ?  [["game_id", 2], ["x_position", 0], ["y_position", 0], ["LIMIT", 1]]
UPDATE "enemies" SET "health" = ?, "updated_at" = ? WHERE "enemies"."id" = ?  [["health", 286], ["updated_at", "2024-12-03 19:55:01.807945"], ["id", 101]]
UPDATE "game_users" SET "x_position" = ?, "y_position" = ? WHERE "game_users"."id" = ?  [["x_position", 0], ["y_position", 0], ["id", 1]]

    when 'Healer'
      if @game_user.use_mana(20)
        healing = (@game_user.user.special_attack).to_i
        @game_user.update(health: [@game_user.health + healing, @game_user.user.health].min)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def magic_heal
    @game = Game.find_by(code: params[:game_id])
    @game_user = @game.game_users.find_by(user: current_user)
    @enemy = @game.enemies.find_by(x_position: @game_user.x_position, y_position: @game_user.y_position)
    @player = current_user.current_skin # Use current_skin for player stats
    @game_id = params[:game_id]
    message = ''

    if @game_user.use_mana(20)
      healing = (@player.special_attack * 0.5).to_i
      @game_user.update(health: [@game_user.health + healing, @player.health].min)
---
SELECT "games".* FROM "games" WHERE "games"."code" = ? LIMIT ?  [["code", "EG6A"], ["LIMIT", 1]]
SELECT "game_users".* FROM "game_users" WHERE "game_users"."game_id" = ? AND "game_users"."user_id" = ? LIMIT ?  [["game_id", 2], ["user_id", 3], ["LIMIT", 1]]
SELECT "enemies".* FROM "enemies" WHERE "enemies"."game_id" = ? AND "enemies"."x_position" = ? AND "enemies"."y_position" = ? LIMIT ?  [["game_id", 2], ["x_position", 0], ["y_position", 0], ["LIMIT", 1]]
UPDATE "game_users" SET "health" = ? WHERE "game_users"."id" = ?  [["health", 72], ["id", 2]]