app/controllers/inventory_controller.rb

INSERT INTO "skins" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["user_id", 1], ["created_at", "2024-12-07 23:06:24.494566"], ["updated_at", "2024-12-07 23:06:24.494566"]]
---
  def add
    image_data = params[:image_data]

    begin
      decoded_image = Base64.decode64(image_data)
      raise ArgumentError if decoded_image.blank? || !decoded_image.valid_encoding?

      skin = current_user.skins.build
      skin.image.attach(
        io: StringIO.new(decoded_image),
        filename: "generated_skin_#{Time.now.to_i}.png",
        content_type: "image/png"
      )

UPDATE "skins" SET "updated_at" = ? WHERE "skins"."id" = ?  [["updated_at", "2024-12-07 23:06:24.791674"], ["id", 1]]
---
  def set_current
    skin = current_user.skins.find(params[:id]) # Ensure the skin belongs to the logged-in user
    current_user.skins.update_all(current: false) # Reset all current skins