app/controllers/pages_controller.rb

  def grid
    @user_name = current_user.username
    @profile_picture_url = "/path/to/profile.jpg"
    @stats = [
      { name: "Archetype", value: current_user.archetype },
      { name: "Attack", value: current_user.attack },
      { name: "Special Attack", value: current_user.special_attack },
      { name: "Defense", value: current_user.defense },
      { name: "Special Defense", value: current_user.special_defense },
      { name: "IQ", value: current_user.iq }
    ]
    @players = Game.find_by(code: session[:game_code])&.game_users&.reject { |player| player.user.username == @user_name } || []
---
SELECT "game_users".* FROM "game_users" WHERE "game_users"."user_id" = ? AND "game_users"."game_id" = ? LIMIT ?  [["user_id", 3], ["game_id", 2], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."code" = ? LIMIT ?  [["code", "EG6A"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def set_game_user
    current_game = Game.find_by(code: session[:game_code])
    @game_user = current_user.game_users.find_by(game_id: current_game&.id)
---
SELECT "games".* FROM "games" WHERE "games"."code" = ? LIMIT ?  [["code", "EG6A"], ["LIMIT", 1]]
SELECT "game_users".* FROM "game_users" WHERE "game_users"."user_id" = ? AND "game_users"."game_id" = ? LIMIT ?  [["user_id", 3], ["game_id", 2], ["LIMIT", 1]]