app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "achievements") VALUES (?, ?, ?, ?) RETURNING "id"  [["username", "rabi"], ["email", "fake@gmail.com"], ["password_digest", "[FILTERED]"], ["achievements", "[]"]]