app/controllers/sessions_controller.rb

  def create
    user = User.find_by('email = ? OR username = ?', params[:login], params[:login])
---
SELECT "users".* FROM "users" WHERE (email = ? OR username = ?) LIMIT ?  [[nil, "rabi"], [nil, "rabi"], ["LIMIT", 1]]